In [1]:
import numpy as np
import pandas as pd

In [2]:
from sklearn import metrics

# Base

In [3]:
# Importando a base
train = pd.read_csv('train.csv', index_col=0)
test = pd.read_csv('test.csv')

## Tratamento

In [4]:
# Trocando sex de string (male, female) para int (0, 1)
train['Sex'] = train['Sex'].map( {'female': 1, 'male': 0} ).astype(int)

In [5]:
# Utilizando One Hot Encoding para embarked
new_columns = pd.get_dummies(train['Embarked'], prefix='Embarked')
train = train.join(new_columns)

In [6]:
# Removendo colunas
train = train.drop(columns=['Name', 'Embarked', 'Ticket', 'Cabin'])

In [7]:
# Preenchendo missing values das idades
train['Age'].fillna((train['Age'].mean()), inplace=True)

In [8]:
train.sample(5)

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked_C,Embarked_Q,Embarked_S
PassengerId,,,,,,,,,,
794,0,1,0,29.699118,0,0,30.6958,1,0,0
819,0,3,0,43.000000,0,0,6.4500,0,0,1
701,1,1,1,18.000000,1,0,227.5250,1,0,0
859,1,3,1,24.000000,0,3,19.2583,1,0,0
511,1,3,0,29.000000,0,0,7.7500,0,1,0

In [9]:
train.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age           0
SibSp         0
Parch         0
Fare          0
Embarked_C    0
Embarked_Q    0
Embarked_S    0
dtype: int64

## Salvando a base tratada

In [10]:
#Salvando base nova
train.to_csv('train_treated.csv')